Services/src/DataProcessors/ЗагрузкаВерсийКонфигураций/ЗагрузкаВерсийКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаВерсийКонфигураций</name>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.С_Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>Версии</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Services/src/Catalogs/С_ВерсииКонфигураций/С_ВерсииКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>С_ВерсииКонфигураций</name>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.С_Конфигурации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Services/src/DataProcessors/ЗагрузкаВерсийКонфигураций/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

Процедура ЗагрузитьнаСервере()
	
	ТабличныйДокумент =  Объект.Версии;
	КолвоСтрокФайла = Объект.Версии.ВысотаТаблицы-1;
		
	Если КолвоСтрокФайла = 0 Тогда
		ТабличныйДокумент = Неопределено;
	КонецЕсли;
	
	Для ит = 1 ПО КолвоСтрокФайла Цикл
		
		нстр = СтрЗаменить(ит, Символы.НПП, "");
		
		Если  ТабличныйДокумент.ПолучитьОбласть("R"+ нстр + "C1").ТекущаяОбласть.Текст = "" Тогда
			Прервать;
		КонецЕсли;
		
		ВерсияСтр =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R"+ нстр + "C1").ТекущаяОбласть.Текст);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	С_ВерсииКонфигураций.Ссылка
		|ИЗ
		|	Справочник.С_ВерсииКонфигураций КАК С_ВерсииКонфигураций
		|ГДЕ
		|	С_ВерсииКонфигураций.Версия = &Версия
		|	И С_ВерсииКонфигураций.Конфигурация = &Конфигурация";
		
		Запрос.УстановитьПараметр("Версия", ВерсияСтр);
		Запрос.УстановитьПараметр("Конфигурация", Объект.Конфигурация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Продолжить;
		Иначе
			НовыйЭлт = Справочники.С_ВерсииКонфигураций.СоздатьЭлемент();
			НовыйЭлт.Версия = ВерсияСтр;
			НовыйЭлт.Конфигурация = Объект.Конфигурация;
			НовыйЭлт.Наименование  = Строка(Объект.Конфигурация) + " " +  Строка(ВерсияСтр);
			НовыйЭлт.Записать();
		КонецЕсли;	
			
		
    КонецЦикла;
	
	
	
КонецПроцедуры
